espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG2_COUNTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2c)
/** AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x30)
/** AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x34)
/** AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x38)
/** AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_COUNTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x3c)
/** AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x40)
/** AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x44)
/** AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x48)
/** AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4c)
/** AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x50)
/** AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x54)
/** AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER2_RESULT_S  0

