espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG6_COUNTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x58)
/** AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x5c)
/** AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x60)
/** AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x64)
/** AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x68)
/** AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x6c)
/** AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x70)
/** AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_COUNTER3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER3_REG (DR_REG_AXI_PERF_MON_BASE + 0x74)
/** AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x78)
/** AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x7c)
/** AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x80)
/** AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x84)
/** AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x88)
/** AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x8c)
/** AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_COUNTER4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER4_REG (DR_REG_AXI_PERF_MON_BASE + 0x90)
/** AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0x94)
/** AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0x98)
/** AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0x9c)
/** AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0xa0)
/** AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0xa4)
/** AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0xa8)
/** AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER5_RESULT_S  0

