espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG6_COUNTER5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER5_REG (DR_REG_AXI_PERF_MON_BASE + 0xac)
/** AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xb0)
/** AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xb4)
/** AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xb8)
/** AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xbc)
/** AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xc0)
/** AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xc4)
/** AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_COUNTER6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER6_REG (DR_REG_AXI_PERF_MON_BASE + 0xc8)
/** AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xcc)
/** AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xd0)
/** AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xd4)
/** AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xd8)
/** AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_COUNTER7_RESULT_S  0

