espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG4_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xdc)
/** AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xe0)
/** AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_COUNTER7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER7_REG (DR_REG_AXI_PERF_MON_BASE + 0xe4)
/** AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT : RO; bitpos: [31:0]; default: 0;
 *  The result for sel agent metric measured in this counter, [15:0] is min result, and
 *  [31:16] is max result
 */
#define AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT_M  (AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT_V << AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_COUNTER7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xe8)
/** AXI_PERF_MON_SEL_AG0_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xec)
/** AXI_PERF_MON_SEL_AG1_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xf0)
/** AXI_PERF_MON_SEL_AG2_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xf4)
/** AXI_PERF_MON_SEL_AG3_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xf8)
/** AXI_PERF_MON_SEL_AG4_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0xfc)
/** AXI_PERF_MON_SEL_AG5_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0x100)
/** AXI_PERF_MON_SEL_AG6_RANGE0_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE0_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE0_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE0_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE0_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE0_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE0_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x104)
/** AXI_PERF_MON_SEL_AG0_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x108)
/** AXI_PERF_MON_SEL_AG1_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x10c)
/** AXI_PERF_MON_SEL_AG2_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x110)
/** AXI_PERF_MON_SEL_AG3_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x114)
/** AXI_PERF_MON_SEL_AG4_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x118)
/** AXI_PERF_MON_SEL_AG5_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE1_REG (DR_REG_AXI_PERF_MON_BASE + 0x11c)
/** AXI_PERF_MON_SEL_AG6_RANGE1_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE1_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE1_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE1_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE1_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE1_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE1_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x120)
/** AXI_PERF_MON_SEL_AG0_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x124)
/** AXI_PERF_MON_SEL_AG1_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x128)
/** AXI_PERF_MON_SEL_AG2_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE2_RESULT_S  0

