espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG3_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x12c)
/** AXI_PERF_MON_SEL_AG3_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x130)
/** AXI_PERF_MON_SEL_AG4_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x134)
/** AXI_PERF_MON_SEL_AG5_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x138)
/** AXI_PERF_MON_SEL_AG6_RANGE2_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE2_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE2_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE2_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE2_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE2_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE2_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x13c)
/** AXI_PERF_MON_SEL_AG0_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x140)
/** AXI_PERF_MON_SEL_AG1_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x144)
/** AXI_PERF_MON_SEL_AG2_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x148)
/** AXI_PERF_MON_SEL_AG3_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x14c)
/** AXI_PERF_MON_SEL_AG4_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x150)
/** AXI_PERF_MON_SEL_AG5_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x154)
/** AXI_PERF_MON_SEL_AG6_RANGE3_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE3_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE3_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE3_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE3_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE3_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE3_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x158)
/** AXI_PERF_MON_SEL_AG0_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x15c)
/** AXI_PERF_MON_SEL_AG1_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE4_RESULT_S  0

