espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG2_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x160)
/** AXI_PERF_MON_SEL_AG2_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x164)
/** AXI_PERF_MON_SEL_AG3_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x168)
/** AXI_PERF_MON_SEL_AG4_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x16c)
/** AXI_PERF_MON_SEL_AG5_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE4_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE4_REG (DR_REG_AXI_PERF_MON_BASE + 0x170)
/** AXI_PERF_MON_SEL_AG6_RANGE4_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE4_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE4_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE4_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE4_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE4_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE4_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x174)
/** AXI_PERF_MON_SEL_AG0_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x178)
/** AXI_PERF_MON_SEL_AG1_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x17c)
/** AXI_PERF_MON_SEL_AG2_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x180)
/** AXI_PERF_MON_SEL_AG3_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x184)
/** AXI_PERF_MON_SEL_AG4_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x188)
/** AXI_PERF_MON_SEL_AG5_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE5_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x18c)
/** AXI_PERF_MON_SEL_AG6_RANGE5_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE5_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE5_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE5_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE5_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE5_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE5_RESULT_S  0

