espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x190)
/** AXI_PERF_MON_SEL_AG0_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x194)
/** AXI_PERF_MON_SEL_AG1_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x198)
/** AXI_PERF_MON_SEL_AG2_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x19c)
/** AXI_PERF_MON_SEL_AG3_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x1a0)
/** AXI_PERF_MON_SEL_AG4_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x1a4)
/** AXI_PERF_MON_SEL_AG5_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG6_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x1a8)
/** AXI_PERF_MON_SEL_AG6_RANGE6_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE6_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE6_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE6_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE6_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE6_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE6_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1ac)
/** AXI_PERF_MON_SEL_AG0_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG0_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG0_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG0_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG0_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG1_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1b0)
/** AXI_PERF_MON_SEL_AG1_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG1_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG1_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG1_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG1_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG2_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1b4)
/** AXI_PERF_MON_SEL_AG2_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG2_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG2_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG2_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG2_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG3_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1b8)
/** AXI_PERF_MON_SEL_AG3_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG3_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG3_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG3_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG3_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG4_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1bc)
/** AXI_PERF_MON_SEL_AG4_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG4_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG4_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG4_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG4_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG5_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1c0)
/** AXI_PERF_MON_SEL_AG5_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG5_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG5_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG5_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG5_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RANGE7_RESULT_S  0

