espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG6_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x1c4)
/** AXI_PERF_MON_SEL_AG6_RANGE7_RESULT : RO; bitpos: [15:0]; default: 0;
 *  The interval statistics results in this counter for sel agent
 */
#define AXI_PERF_MON_SEL_AG6_RANGE7_RESULT    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE7_RESULT_M  (AXI_PERF_MON_SEL_AG6_RANGE7_RESULT_V << AXI_PERF_MON_SEL_AG6_RANGE7_RESULT_S)
#define AXI_PERF_MON_SEL_AG6_RANGE7_RESULT_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RANGE7_RESULT_S  0

/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1c8)
/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1cc)
/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1d0)
/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1d4)
/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1d8)
/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1dc)
/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x1e0)
/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1e4)
/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1e8)
/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD1_S  0

