espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1ec)
/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1f0)
/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1f4)
/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1f8)
/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x1fc)
/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x200)
/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x204)
/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x208)
/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x20c)
/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x210)
/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x214)
/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x218)
/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x21c)
/** AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x220)
/** AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x224)
/** AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x228)
/** AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x22c)
/** AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x230)
/** AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x234)
/** AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for ARLEN,
 *  [23:8] for ARID
 */
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_AXI_INFO_RECORD3_S  0

