espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x238)
/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x23c)
/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x240)
/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x244)
/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x248)
/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x24c)
/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_REG (DR_REG_AXI_PERF_MON_BASE + 0x250)
/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_M  (AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_V << AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_S)
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD0_S  0

/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x254)
/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x258)
/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x25c)
/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD1_S  0

