espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x260)
/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x264)
/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x268)
/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_REG (DR_REG_AXI_PERF_MON_BASE + 0x26c)
/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_M  (AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_V << AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_S)
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD1_S  0

/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x270)
/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x274)
/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x278)
/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x27c)
/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x280)
/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x284)
/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_REG (DR_REG_AXI_PERF_MON_BASE + 0x288)
/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_M  (AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_V << AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_S)
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD2_S  0

/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x28c)
/** AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x290)
/** AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x294)
/** AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x298)
/** AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x29c)
/** AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x2a0)
/** AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_REG (DR_REG_AXI_PERF_MON_BASE + 0x2a4)
/** AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3 : RO; bitpos: [15:0]; default: 0;
 *  The latest x axi transaction information record for sel agent, [7:0] for AWLEN,
 *  [23:8] for AWID
 */
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_M  (AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_V << AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_S)
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_AXI_INFO_RECORD3_S  0

/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2a8)
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2ac)
/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2b0)
/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2b4)
/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2b8)
/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2bc)
/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA0_S  0

/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_REG (DR_REG_AXI_PERF_MON_BASE + 0x2c0)
/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_M  (AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_V << AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_S)
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA0_S  0

