espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2c4)
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2c8)
/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2cc)
/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2d0)
/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2d4)
/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2d8)
/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_REG (DR_REG_AXI_PERF_MON_BASE + 0x2dc)
/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_M  (AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_V << AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_S)
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA1_S  0

/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2e0)
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2e4)
/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2e8)
/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2ec)
/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2f0)
/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2f4)
/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_REG (DR_REG_AXI_PERF_MON_BASE + 0x2f8)
/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_M  (AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_V << AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_S)
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA2_S  0

/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x2fc)
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x300)
/** AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x304)
/** AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x308)
/** AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x30c)
/** AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x310)
/** AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_REG (DR_REG_AXI_PERF_MON_BASE + 0x314)
/** AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  The latest x bandwidth date num in config time record for sel agent, [15:0] for
 *  Read and [31:16] for write
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_M  (AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_V << AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_S)
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_DATA3_S  0

/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0x318)
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE0_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0x31c)
/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH_V << AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW_M  (AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW_V << AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE0_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_REG (DR_REG_AXI_PERF_MON_BASE + 0x320)
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE0_CNT_LOW_S  16

