espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_REG (DR_REG_AXI_PERF_MON_BASE + 0x368)
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE2_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x36c)
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x370)
/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x374)
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x378)
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x37c)
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x380)
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE3_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_REG (DR_REG_AXI_PERF_MON_BASE + 0x384)
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE3_CNT_LOW_S  16

