espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x3ac)
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW_M  (AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW_V << AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_RANGE5_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x3b0)
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE5_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x3b4)
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE5_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x3b8)
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE5_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_REG (DR_REG_AXI_PERF_MON_BASE + 0x3bc)
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE5_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_REG (DR_REG_AXI_PERF_MON_BASE + 0x3c0)
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW_M  (AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW_V << AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_RANGE6_CNT_LOW_S  16

