espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x3e8)
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW_M  (AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW_V << AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_RANGE7_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x3ec)
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW_M  (AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW_V << AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_RANGE7_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x3f0)
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW_M  (AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW_V << AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_RANGE7_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_REG (DR_REG_AXI_PERF_MON_BASE + 0x3f4)
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH : R/W; bitpos: [15:0]; default: 0;
 *  The x Upper limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_HIGH_S  0
/** AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW : R/W; bitpos: [31:16]; default: 0;
 *  The x Lower limit of interval statistics for sel metric in sel agent
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW_M  (AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW_V << AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_RANGE7_CNT_LOW_S  16

/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x3f8)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x3fc)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x400)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x404)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x408)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK0_S  0

