espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x40c)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x410)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x414)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x418)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x41c)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x420)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x424)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x428)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x42c)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x430)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x434)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x438)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x43c)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_MASK2_S  0

