espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x440)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x444)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x448)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x44c)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x450)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x454)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x458)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x45c)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x460)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_REG (DR_REG_AXI_PERF_MON_BASE + 0x464)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK0_S  0

/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x468)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x46c)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK1_S  0

