espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x470)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x474)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x478)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x47c)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_REG (DR_REG_AXI_PERF_MON_BASE + 0x480)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK1_S  0

/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x484)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x488)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x48c)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x490)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x494)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_MASK2_S  0

