espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x498)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_REG (DR_REG_AXI_PERF_MON_BASE + 0x49c)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2 : R/W; bitpos: [31:0]; default: 0;
 *  Write addr mask of addr filter function for sel agent, mask bit will not compare
 *  with addr
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_MASK2_S  0

/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4a0)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4a4)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4a8)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4ac)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4b0)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4b4)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4b8)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4bc)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4c0)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4c4)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4c8)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4cc)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4d0)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x4d4)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER1_S  0

