espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4d8)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4dc)
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4e0)
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4e4)
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4e8)
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4ec)
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x4f0)
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4f4)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4f8)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x4fc)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x500)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x504)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x508)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER0_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_REG (DR_REG_AXI_PERF_MON_BASE + 0x50c)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER0_S  0

