espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x510)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x514)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x518)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x51c)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x520)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x524)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_REG (DR_REG_AXI_PERF_MON_BASE + 0x528)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER1_S  0

/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x52c)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x530)
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x534)
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x538)
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x53c)
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x540)
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER2_S  0

/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_REG (DR_REG_AXI_PERF_MON_BASE + 0x544)
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2 : R/W; bitpos: [31:0]; default: 0;
 *  Read addr filter of addr filter function for sel agent, no mask bit in addr will
 *  compare with addr filter, if compare result same will pass filter
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER2_S  0

