espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x548)
/** AXI_PERF_MON_SEL_AG0_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x54c)
/** AXI_PERF_MON_SEL_AG1_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x550)
/** AXI_PERF_MON_SEL_AG2_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x554)
/** AXI_PERF_MON_SEL_AG3_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x558)
/** AXI_PERF_MON_SEL_AG4_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x55c)
/** AXI_PERF_MON_SEL_AG5_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_REG (DR_REG_AXI_PERF_MON_BASE + 0x560)
/** AXI_PERF_MON_SEL_AG6_METRIC_SELECT1 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT1    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_M  (AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_V << AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT1_S  0

/** AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x564)
/** AXI_PERF_MON_SEL_AG0_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG0_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x568)
/** AXI_PERF_MON_SEL_AG1_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG1_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x56c)
/** AXI_PERF_MON_SEL_AG2_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG2_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x570)
/** AXI_PERF_MON_SEL_AG3_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG3_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x574)
/** AXI_PERF_MON_SEL_AG4_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG4_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x578)
/** AXI_PERF_MON_SEL_AG5_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG5_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_REG (DR_REG_AXI_PERF_MON_BASE + 0x57c)
/** AXI_PERF_MON_SEL_AG6_METRIC_SELECT2 : R/W; bitpos: [31:0]; default: 0;
 *  Metric select Reg for sel agent, each agent use 8 bits, low 5 bits means which
 *  metric is selected for current counter, high 3 bits means range metric this counter
 *  measured, a counter can use metric and range measure at the same time
 */
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT2    0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_M  (AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_V << AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_S)
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_V  0xFFFFFFFFU
#define AXI_PERF_MON_SEL_AG6_METRIC_SELECT2_S  0

/** AXI_PERF_MON_SEL_AG_RD_ADDR_REGION_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_RD_ADDR_REGION_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x580)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL : R/W; bitpos: [2:0]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_REGION_SEL_S  0
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL : R/W; bitpos: [5:3]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_REGION_SEL_S  3
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL : R/W; bitpos: [8:6]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_REGION_SEL_S  6
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL : R/W; bitpos: [11:9]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_REGION_SEL_S  9
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL : R/W; bitpos: [14:12]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_REGION_SEL_S  12
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL : R/W; bitpos: [17:15]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_REGION_SEL_S  15
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL : R/W; bitpos: [20:18]; default: 0;
 *  SW config Read region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_REGION_SEL_S  18

/** AXI_PERF_MON_SEL_AG_WR_ADDR_REGION_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_WR_ADDR_REGION_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x584)
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL : R/W; bitpos: [2:0]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_REGION_SEL_S  0
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL : R/W; bitpos: [5:3]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_REGION_SEL_S  3
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL : R/W; bitpos: [8:6]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_REGION_SEL_S  6
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL : R/W; bitpos: [11:9]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_REGION_SEL_S  9
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL : R/W; bitpos: [14:12]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_REGION_SEL_S  12
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL : R/W; bitpos: [17:15]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_REGION_SEL_S  15
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL : R/W; bitpos: [20:18]; default: 0;
 *  SW config Write region select, use with mask and filter, only when addr in one
 *  region and this region has been sel, will measure the transaction data num
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL    0x00000007U
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL_V  0x00000007U
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_REGION_SEL_S  18

