espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG_ADDR_FILTER_EN_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_ADDR_FILTER_EN_REG (DR_REG_AXI_PERF_MON_BASE + 0x588)
/** AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN : R/W; bitpos: [0]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RD_ADDR_FILTER_EN_S  0
/** AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN : R/W; bitpos: [1]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RD_ADDR_FILTER_EN_S  1
/** AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN : R/W; bitpos: [2]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RD_ADDR_FILTER_EN_S  2
/** AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN : R/W; bitpos: [3]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RD_ADDR_FILTER_EN_S  3
/** AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN : R/W; bitpos: [4]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RD_ADDR_FILTER_EN_S  4
/** AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN : R/W; bitpos: [5]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RD_ADDR_FILTER_EN_S  5
/** AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN : R/W; bitpos: [6]; default: 0;
 *  Enable read addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RD_ADDR_FILTER_EN_S  6
/** AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN : R/W; bitpos: [7]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN    (BIT(7))
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_WR_ADDR_FILTER_EN_S  7
/** AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN : R/W; bitpos: [8]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN    (BIT(8))
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_WR_ADDR_FILTER_EN_S  8
/** AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN : R/W; bitpos: [9]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN    (BIT(9))
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_WR_ADDR_FILTER_EN_S  9
/** AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN : R/W; bitpos: [10]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN    (BIT(10))
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_WR_ADDR_FILTER_EN_S  10
/** AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN    (BIT(11))
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_WR_ADDR_FILTER_EN_S  11
/** AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN : R/W; bitpos: [12]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN    (BIT(12))
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_WR_ADDR_FILTER_EN_S  12
/** AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN : R/W; bitpos: [13]; default: 0;
 *  Enable write addr filter function, if 0, all address access will be record
 */
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN    (BIT(13))
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN_M  (AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN_V << AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN_S)
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_WR_ADDR_FILTER_EN_S  13

/** AXI_PERF_MON_SEL_AG_SW_RECORD_STOP_EN_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_SW_RECORD_STOP_EN_REG (DR_REG_AXI_PERF_MON_BASE + 0x58c)
/** AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN : WT; bitpos: [0]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_SW_RECORD_STOP_EN_S  0
/** AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN : WT; bitpos: [1]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_SW_RECORD_STOP_EN_S  1
/** AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN : WT; bitpos: [2]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_SW_RECORD_STOP_EN_S  2
/** AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN : WT; bitpos: [3]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_SW_RECORD_STOP_EN_S  3
/** AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN : WT; bitpos: [4]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_SW_RECORD_STOP_EN_S  4
/** AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN : WT; bitpos: [5]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_SW_RECORD_STOP_EN_S  5
/** AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN : WT; bitpos: [6]; default: 0;
 *  SW use to stop event log function, record information will keep
 */
#define AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN_M  (AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN_V << AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN_S)
#define AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_SW_RECORD_STOP_EN_S  6

