espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5b4)
/** AXI_PERF_MON_SEL_AG0_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG0_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG0_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG0_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG0_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG0_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG0_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG0_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG0_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG0_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG0_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG0_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG0_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG0_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG1_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5b8)
/** AXI_PERF_MON_SEL_AG1_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG1_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG1_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG1_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG1_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG1_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG1_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG1_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG1_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG1_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG1_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG1_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG1_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG1_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG2_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5bc)
/** AXI_PERF_MON_SEL_AG2_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG2_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG2_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG2_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG2_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG2_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG2_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG2_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG2_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG2_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG2_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG2_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG2_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG2_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG3_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5c0)
/** AXI_PERF_MON_SEL_AG3_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG3_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG3_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG3_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG3_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG3_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG3_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG3_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG3_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG3_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG3_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG3_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG3_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG3_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG4_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5c4)
/** AXI_PERF_MON_SEL_AG4_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG4_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG4_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG4_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG4_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG4_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG4_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG4_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG4_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG4_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG4_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG4_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG4_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG4_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG5_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5c8)
/** AXI_PERF_MON_SEL_AG5_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG5_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG5_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG5_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG5_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG5_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG5_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG5_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG5_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG5_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG5_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG5_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG5_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG5_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG6_ID_MASK_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_ID_MASK_REG (DR_REG_AXI_PERF_MON_BASE + 0x5cc)
/** AXI_PERF_MON_SEL_AG6_RD_ID_MASK : R/W; bitpos: [6:0]; default: 0;
 *  Read id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG6_RD_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG6_RD_ID_MASK_M  (AXI_PERF_MON_SEL_AG6_RD_ID_MASK_V << AXI_PERF_MON_SEL_AG6_RD_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG6_RD_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG6_RD_ID_MASK_S  0
/** AXI_PERF_MON_SEL_AG6_WR_ID_MASK : R/W; bitpos: [13:7]; default: 0;
 *  Write id mask, ignore mask id bits
 */
#define AXI_PERF_MON_SEL_AG6_WR_ID_MASK    0x0000007FU
#define AXI_PERF_MON_SEL_AG6_WR_ID_MASK_M  (AXI_PERF_MON_SEL_AG6_WR_ID_MASK_V << AXI_PERF_MON_SEL_AG6_WR_ID_MASK_S)
#define AXI_PERF_MON_SEL_AG6_WR_ID_MASK_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG6_WR_ID_MASK_S  7

/** AXI_PERF_MON_SEL_AG0_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5d0)
/** AXI_PERF_MON_SEL_AG0_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG0_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG0_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG0_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG0_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG0_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG0_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG0_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG0_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG0_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG0_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG0_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG0_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG0_WR_ID_FILTER_S  7

