espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG1_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5d4)
/** AXI_PERF_MON_SEL_AG1_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG1_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG1_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG1_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG1_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG1_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG1_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG1_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG1_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG1_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG1_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG1_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG1_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG1_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG2_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5d8)
/** AXI_PERF_MON_SEL_AG2_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG2_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG2_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG2_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG2_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG2_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG2_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG2_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG2_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG2_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG2_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG2_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG2_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG2_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG3_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5dc)
/** AXI_PERF_MON_SEL_AG3_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG3_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG3_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG3_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG3_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG3_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG3_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG3_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG3_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG3_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG3_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG3_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG3_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG3_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG4_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5e0)
/** AXI_PERF_MON_SEL_AG4_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG4_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG4_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG4_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG4_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG4_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG4_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG4_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG4_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG4_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG4_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG4_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG4_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG4_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG5_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5e4)
/** AXI_PERF_MON_SEL_AG5_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG5_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG5_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG5_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG5_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG5_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG5_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG5_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG5_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG5_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG5_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG5_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG5_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG5_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG6_ID_FILTER_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_ID_FILTER_REG (DR_REG_AXI_PERF_MON_BASE + 0x5e8)
/** AXI_PERF_MON_SEL_AG6_RD_ID_FILTER : R/W; bitpos: [6:0]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG6_RD_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG6_RD_ID_FILTER_M  (AXI_PERF_MON_SEL_AG6_RD_ID_FILTER_V << AXI_PERF_MON_SEL_AG6_RD_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG6_RD_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG6_RD_ID_FILTER_S  0
/** AXI_PERF_MON_SEL_AG6_WR_ID_FILTER : R/W; bitpos: [13:7]; default: 0;
 *  Use with mask, no mask bits must same as filter bits, the pass filter
 */
#define AXI_PERF_MON_SEL_AG6_WR_ID_FILTER    0x0000007FU
#define AXI_PERF_MON_SEL_AG6_WR_ID_FILTER_M  (AXI_PERF_MON_SEL_AG6_WR_ID_FILTER_V << AXI_PERF_MON_SEL_AG6_WR_ID_FILTER_S)
#define AXI_PERF_MON_SEL_AG6_WR_ID_FILTER_V  0x0000007FU
#define AXI_PERF_MON_SEL_AG6_WR_ID_FILTER_S  7

/** AXI_PERF_MON_SEL_AG_BANDW_TEST_EN_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_BANDW_TEST_EN_REG (DR_REG_AXI_PERF_MON_BASE + 0x5ec)
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_EN_S  0
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN : R/W; bitpos: [1]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN    (BIT(1))
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_EN_S  1
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN    (BIT(2))
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_EN_S  2
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN : R/W; bitpos: [3]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN    (BIT(3))
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_EN_S  3
/** AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN : R/W; bitpos: [4]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN    (BIT(4))
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_EN_S  4
/** AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN : R/W; bitpos: [5]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN    (BIT(5))
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_EN_S  5
/** AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN : R/W; bitpos: [6]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN    (BIT(6))
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_EN_S  6
/** AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN : R/W; bitpos: [7]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN    (BIT(7))
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_EN_S  7
/** AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN : R/W; bitpos: [8]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN    (BIT(8))
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_EN_S  8
/** AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN : R/W; bitpos: [9]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN    (BIT(9))
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_EN_S  9
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN : R/W; bitpos: [10]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN    (BIT(10))
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_EN_S  10
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN : R/W; bitpos: [11]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN    (BIT(11))
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_EN_S  11
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN : R/W; bitpos: [12]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN    (BIT(12))
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_EN_S  12
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN : R/W; bitpos: [13]; default: 0;
 *  Enable Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN    (BIT(13))
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_EN_S  13

/** AXI_PERF_MON_SEL_AG_BANDW_TEST_STOP_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_BANDW_TEST_STOP_REG (DR_REG_AXI_PERF_MON_BASE + 0x5f0)
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TEST_STOP_S  0
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP : R/W; bitpos: [1]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP    (BIT(1))
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TEST_STOP_S  1
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP    (BIT(2))
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TEST_STOP_S  2
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP : R/W; bitpos: [3]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP    (BIT(3))
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TEST_STOP_S  3
/** AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP : R/W; bitpos: [4]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP    (BIT(4))
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TEST_STOP_S  4
/** AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP : R/W; bitpos: [5]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP    (BIT(5))
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TEST_STOP_S  5
/** AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP : R/W; bitpos: [6]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP    (BIT(6))
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TEST_STOP_S  6
/** AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP : R/W; bitpos: [7]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP    (BIT(7))
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TEST_STOP_S  7
/** AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP : R/W; bitpos: [8]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP    (BIT(8))
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TEST_STOP_S  8
/** AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP : R/W; bitpos: [9]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP    (BIT(9))
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TEST_STOP_S  9
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP : R/W; bitpos: [10]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP    (BIT(10))
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TEST_STOP_S  10
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP : R/W; bitpos: [11]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP    (BIT(11))
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TEST_STOP_S  11
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP : R/W; bitpos: [12]; default: 0;
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP    (BIT(12))
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TEST_STOP_S  12
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP : R/W; bitpos: [13]; default: 0;
 *  Stop Read average bandwidth test for all select agent in the same time
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP    (BIT(13))
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TEST_STOP_S  13

/** AXI_PERF_MON_SEL_AG0_BANDW_TRIGGER_IN_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_BANDW_TRIGGER_IN_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x5f4)
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [3:0]; default: 0;
 *  Read average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_EN_SEL_S  0
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [7:4]; default: 0;
 *  Read average bandwidth test, trigger by soc, sel source, SW register config is one
 *  source
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TRIGGER_STOP_SEL_S  4
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [11:8]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_EN_SEL_S  8
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [15:12]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TRIGGER_STOP_SEL_S  12

/** AXI_PERF_MON_SEL_AG1_BANDW_TRIGGER_IN_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_BANDW_TRIGGER_IN_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x5f8)
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [3:0]; default: 0;
 *  Read average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_EN_SEL_S  0
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [7:4]; default: 0;
 *  Read average bandwidth test, trigger by soc, sel source, SW register config is one
 *  source
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TRIGGER_STOP_SEL_S  4
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [11:8]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_EN_SEL_S  8
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [15:12]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TRIGGER_STOP_SEL_S  12

