espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG5_BANDW_TRIGGER_IN_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_BANDW_TRIGGER_IN_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x608)
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [3:0]; default: 0;
 *  Read average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_EN_SEL_S  0
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [7:4]; default: 0;
 *  Read average bandwidth test, trigger by soc, sel source, SW register config is one
 *  source
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TRIGGER_STOP_SEL_S  4
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [11:8]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_EN_SEL_S  8
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [15:12]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TRIGGER_STOP_SEL_S  12

/** AXI_PERF_MON_SEL_AG6_BANDW_TRIGGER_IN_SEL_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_BANDW_TRIGGER_IN_SEL_REG (DR_REG_AXI_PERF_MON_BASE + 0x60c)
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [3:0]; default: 0;
 *  Read average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_EN_SEL_S  0
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [7:4]; default: 0;
 *  Read average bandwidth test, trigger by soc, sel source, SW register config is one
 *  source
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TRIGGER_STOP_SEL_S  4
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL : R/W; bitpos: [11:8]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_EN_SEL_S  8
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL : R/W; bitpos: [15:12]; default: 0;
 *  Write average bandwidth test, trigger enable by soc, sel source, SW register config
 *  is one source
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL    0x0000000FU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL_V  0x0000000FU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TRIGGER_STOP_SEL_S  12

/** AXI_PERF_MON_SEL_AG0_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x610)
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG0_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG1_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x614)
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG1_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG2_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x618)
/** AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG2_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG3_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x61c)
/** AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG3_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG4_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x620)
/** AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG4_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG5_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x624)
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG5_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG6_WR_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x628)
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG6_WR_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG0_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x62c)
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG0_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG1_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x630)
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG1_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG2_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x634)
/** AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG2_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG3_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x638)
/** AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG3_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG4_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x63c)
/** AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG4_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG5_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x640)
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG5_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

/** AXI_PERF_MON_SEL_AG6_RD_BANDW_CNT_VALID_STROBE_NUM_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_CNT_VALID_STROBE_NUM_REG (DR_REG_AXI_PERF_MON_BASE + 0x644)
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM : R/W; bitpos: [7:0];
 *  default: 0;
 *  Set this register to configure the time valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_TIME_CNT_VALID_STROBE_NUM_S  0
/** AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM : R/W; bitpos: [15:8];
 *  default: 0;
 *  Set this register to configure the data valid scaling multiplier
 */
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM    0x000000FFU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_M  (AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V << AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S)
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_V  0x000000FFU
#define AXI_PERF_MON_SEL_AG6_RD_BANDW_DATA_CNT_VALID_STROBE_NUM_S  8

