espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG0_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG0_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x648)
/** AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG0_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG1_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG1_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x64c)
/** AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG1_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG2_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG2_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x650)
/** AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG2_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG3_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG3_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x654)
/** AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG3_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG4_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG4_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x658)
/** AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG4_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG5_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG5_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x65c)
/** AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG5_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG6_INS_BANDW_TIME_THR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG6_INS_BANDW_TIME_THR_REG (DR_REG_AXI_PERF_MON_BASE + 0x660)
/** AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR : R/W; bitpos: [15:0]; default: 0;
 *  Read instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_RD_INS_BANDW_TIME_THR_S  0
/** AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR : R/W; bitpos: [31:16]; default: 0;
 *  Write instantaneous bandwidth test time limit, counter data num in this time unit,
 *  and will fresh counter to count again
 */
#define AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR    0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR_M  (AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR_V << AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR_S)
#define AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR_V  0x0000FFFFU
#define AXI_PERF_MON_SEL_AG6_WR_INS_BANDW_TIME_THR_S  16

/** AXI_PERF_MON_SEL_AG_INT_RAW_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_INT_RAW_REG (DR_REG_AXI_PERF_MON_BASE + 0x664)
/** AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [0];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  0
/** AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [1];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  1
/** AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [2];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  2
/** AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [3];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  3
/** AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [4];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  4
/** AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [5];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  5
/** AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW : R/WTC/SS; bitpos: [6];
 *  default: 0;
 *  The raw interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW_M  (AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW_V << AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW_S)
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_RAW_S  6

/** AXI_PERF_MON_SEL_AG_INT_ST_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_INT_ST_REG (DR_REG_AXI_PERF_MON_BASE + 0x668)
/** AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ST_S  0
/** AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ST_S  1
/** AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ST_S  2
/** AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ST_S  3
/** AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ST_S  4
/** AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ST_S  5
/** AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status of instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST_M  (AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST_V << AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST_S)
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ST_S  6

/** AXI_PERF_MON_SEL_AG_INT_ENA_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_INT_ENA_REG (DR_REG_AXI_PERF_MON_BASE + 0x66c)
/** AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  0
/** AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  1
/** AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  2
/** AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  3
/** AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  4
/** AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  5
/** AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA_M  (AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA_V << AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA_S)
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_ENA_S  6

