espressif/esp-idf/components/soc/esp32s31/register/soc/axi_perf_mon_reg.h
/** AXI_PERF_MON_SEL_AG_INT_CLR_REG register
 *  reserved
 */
#define AXI_PERF_MON_SEL_AG_INT_CLR_REG (DR_REG_AXI_PERF_MON_BASE + 0x670)
/** AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(0))
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG0_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  0
/** AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(1))
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG1_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  1
/** AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(2))
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG2_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  2
/** AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(3))
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG3_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  3
/** AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(4))
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG4_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  4
/** AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(5))
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG5_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  5
/** AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear instantaneous bandwidth test data under limit int
 */
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR    (BIT(6))
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR_M  (AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR_V << AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR_S)
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR_V  0x00000001U
#define AXI_PERF_MON_SEL_AG6_RECORD_CNT_UNDER_LIMIT_INT_CLR_S  6

/** AXI_PERF_MON_DATE_REG register
 *  reserved
 */
#define AXI_PERF_MON_DATE_REG (DR_REG_AXI_PERF_MON_BASE + 0x674)
/** AXI_PERF_MON_DATE : R/W; bitpos: [27:0]; default: 2506030;
 *  reserved
 */
#define AXI_PERF_MON_DATE    0x0FFFFFFFU
#define AXI_PERF_MON_DATE_M  (AXI_PERF_MON_DATE_V << AXI_PERF_MON_DATE_S)
#define AXI_PERF_MON_DATE_V  0x0FFFFFFFU
#define AXI_PERF_MON_DATE_S  0

#ifdef __cplusplus
}
#endif
